In [3]:
import pandas as pd
import numpy as np

In [4]:
np.random.seed(42)
df = pd.DataFrame({
    'A': np.random.randn(100),
    'B': np.random.randint(1, 10, 100),
    'C': np.random.choice(['X', 'Y', 'Z'], 100),
    'D': pd.date_range('2023-01-01', periods=100, freq='D'),
    'E': np.random.randn(100) * 100
})

In [5]:
df

           A  B  C          D           E
0   0.496714  9  Y 2023-01-01   23.229616
1  -0.138264  5  Y 2023-01-02   17.618092
2   0.647689  1  Y 2023-01-03 -115.256537
3   1.523030  3  Y 2023-01-04 -150.076839
4  -0.234153  8  Z 2023-01-05   16.502280
..       ... .. ..        ...         ...
95 -1.463515  3  Z 2023-04-06   94.914299
96  0.296120  9  X 2023-04-07  -23.922480
97  0.261055  3  X 2023-04-08   85.397471
98  0.005113  9  X 2023-04-09  -27.104046
99 -0.234587  2  Y 2023-04-10  -61.309468

[100 rows x 5 columns]

In [6]:
df.describe()

                A           B                    D           E
count  100.000000  100.000000                  100  100.000000
mean    -0.103847    4.730000  2023-02-19 12:00:00    8.073564
min     -2.619745    1.000000  2023-01-01 00:00:00 -199.496157
25%     -0.600906    2.000000  2023-01-25 18:00:00  -61.360443
50%     -0.126956    4.000000  2023-02-19 12:00:00    3.682609
75%      0.405952    7.000000  2023-03-16 06:00:00   85.966970
max      1.852278    9.000000  2023-04-10 00:00:00  238.903596
std      0.908168    2.733463                  NaN  101.447471

In [7]:
df.describe(include="all")

                 A           B    C                    D           E
count   100.000000  100.000000  100                  100  100.000000
unique         NaN         NaN    3                  NaN         NaN
top            NaN         NaN    X                  NaN         NaN
freq           NaN         NaN   36                  NaN         NaN
mean     -0.103847    4.730000  NaN  2023-02-19 12:00:00    8.073564
min      -2.619745    1.000000  NaN  2023-01-01 00:00:00 -199.496157
25%      -0.600906    2.000000  NaN  2023-01-25 18:00:00  -61.360443
50%      -0.126956    4.000000  NaN  2023-02-19 12:00:00    3.682609
75%       0.405952    7.000000  NaN  2023-03-16 06:00:00   85.966970
max       1.852278    9.000000  NaN  2023-04-10 00:00:00  238.903596
std       0.908168    2.733463  NaN                  NaN  101.447471

In [8]:
df.describe(include="O")

          C
count   100
unique    3
top       X
freq     36

In [10]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
A,0.496714,-0.138264,0.647689,1.52303,-0.234153,-0.234137,1.579213,0.767435,-0.469474,0.54256,...,0.097078,0.968645,-0.702053,-0.327662,-0.392108,-1.463515,0.29612,0.261055,0.005113,-0.234587
B,9,5,1,3,8,6,8,9,4,1,...,8,4,6,8,4,3,9,3,9,2
C,Y,Y,Y,Y,Z,X,X,X,X,Y,...,Z,Y,X,X,Y,Z,X,X,X,Y
D,2023-01-01 00:00:00,2023-01-02 00:00:00,2023-01-03 00:00:00,2023-01-04 00:00:00,2023-01-05 00:00:00,2023-01-06 00:00:00,2023-01-07 00:00:00,2023-01-08 00:00:00,2023-01-09 00:00:00,2023-01-10 00:00:00,...,2023-04-01 00:00:00,2023-04-02 00:00:00,2023-04-03 00:00:00,2023-04-04 00:00:00,2023-04-05 00:00:00,2023-04-06 00:00:00,2023-04-07 00:00:00,2023-04-08 00:00:00,2023-04-09 00:00:00,2023-04-10 00:00:00
E,23.229616,17.618092,-115.256537,-150.076839,16.50228,-85.592892,-3.963614,-53.466274,-178.84965,35.730454,...,-40.791535,26.162306,1.214651,93.093408,-52.318809,94.914299,-23.92248,85.397471,-27.104046,-61.309468

In [11]:
df.describe(include="all").T

,count,unique,top,freq,mean,min,25%,50%,75%,max,std
A,100.0,NaN,NaN,NaN,-0.103847,-2.619745,-0.600906,-0.126956,0.405952,1.852278,0.908168
B,100.0,NaN,NaN,NaN,4.73,1.0,2.0,4.0,7.0,9.0,2.733463
C,100,3,X,36,NaN,NaN,NaN,NaN,NaN,NaN,NaN
D,100,NaN,NaN,NaN,2023-02-19 12:00:00,2023-01-01 00:00:00,2023-01-25 18:00:00,2023-02-19 12:00:00,2023-03-16 06:00:00,2023-04-10 00:00:00,NaN
E,100.0,NaN,NaN,NaN,8.073564,-199.496157,-61.360443,3.682609,85.96697,238.903596,101.447471

In [13]:
df["A"].mean()

-0.10384651739409384

In [14]:
df["A"].median()

-0.1269562917797126

In [15]:
df["A"].std()

0.9081684280078008

In [16]:
df["A"].min()

-2.6197451040897444

In [17]:
df["A"].max()

1.8522781845089378

In [23]:
df["A"].quantile(0.75)

0.40595205201206214

In [19]:
df["A"]

0     0.496714
1    -0.138264
2     0.647689
3     1.523030
4    -0.234153
        ...
95   -1.463515
96    0.296120
97    0.261055
98    0.005113
99   -0.234587
Name: A, Length: 100, dtype: float64

In [ ]:
0123456789

In [25]:
df["C"].unique()

array(['Y', 'Z', 'X'], dtype=object)

In [27]:
df["C"].nunique()

3

In [29]:
df["C"].value_counts()

C
X    36
Y    35
Z    29
Name: count, dtype: int64

In [30]:
df[["A","B"]].mean()

A   -0.103847
B    4.730000
dtype: float64

In [31]:
df["C", "B"].value_counts()

KeyError: ('C', 'B')

In [36]:
df.isnull().sum().sum()

0

In [33]:
df.notnull().sum()

A    100
B    100
C    100
D    100
E    100
dtype: int64

In [37]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'Department': ['HR', 'IT', 'Finance', 'HR', 'IT'],
    'Salary': [70000, 80000, 90000, 75000, 85000]
}
df1 = pd.DataFrame(data, index=['emp1', 'emp2', 'emp3', 'emp4', 'emp5'])

In [38]:
df1

         Name  Age Department  Salary
emp1    Alice   25         HR   70000
emp2      Bob   30         IT   80000
emp3  Charlie   35    Finance   90000
emp4    Diana   28         HR   75000
emp5      Eve   32         IT   85000

In [40]:
df["A"]

0     0.496714
1    -0.138264
2     0.647689
3     1.523030
4    -0.234153
        ...
95   -1.463515
96    0.296120
97    0.261055
98    0.005113
99   -0.234587
Name: A, Length: 100, dtype: float64

In [41]:
df[95]

KeyError: 95

In [44]:
df.loc[1:10:2]

          A  B  C          D           E
1 -0.138264  5  Y 2023-01-02   17.618092
3  1.523030  3  Y 2023-01-04 -150.076839
5 -0.234137  6  X 2023-01-06  -85.592892
7  0.767435  9  X 2023-01-08  -53.466274
9  0.542560  1  Y 2023-01-10   35.730454

In [45]:
df.loc[95]

A              -1.463515
B                      3
C                      Z
D    2023-04-06 00:00:00
E              94.914299
Name: 95, dtype: object

In [46]:
df.tail()

           A  B  C          D          E
95 -1.463515  3  Z 2023-04-06  94.914299
96  0.296120  9  X 2023-04-07 -23.922480
97  0.261055  3  X 2023-04-08  85.397471
98  0.005113  9  X 2023-04-09 -27.104046
99 -0.234587  2  Y 2023-04-10 -61.309468

In [48]:
df.loc[1:100:10,0:4]

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [51]:
df.loc[1:100:10,["A","B", "C"]]

           A  B  C
1  -0.138264  5  Y
11 -0.465730  4  Z
21 -0.225776  2  Y
31  1.852278  6  Y
41  0.171368  2  Y
51 -0.385082  3  Y
61 -0.185659  8  Z
71  1.538037  1  Z
81  0.357113  3  X
91  0.968645  4  Y

In [57]:
df.iloc[0:100:10, 1:3]

    B  C
0   9  Y
10  1  X
20  1  Y
30  5  X
40  4  X
50  3  X
60  2  X
70  4  Y
80  3  X
90  8  Z

In [58]:
df1.loc['emp1':'emp3', 'Name':'Age']

         Name  Age
emp1    Alice   25
emp2      Bob   30
emp3  Charlie   35

In [59]:
df1

         Name  Age Department  Salary
emp1    Alice   25         HR   70000
emp2      Bob   30         IT   80000
emp3  Charlie   35    Finance   90000
emp4    Diana   28         HR   75000
emp5      Eve   32         IT   85000

In [62]:
df1[df1["Age"]>30]

         Name  Age Department  Salary
emp3  Charlie   35    Finance   90000
emp5      Eve   32         IT   85000

In [64]:
df1[ (df1['Age'] > 25) & (df1['Department'] == 'IT')]

     Name  Age Department  Salary
emp2  Bob   30         IT   80000
emp5  Eve   32         IT   85000

In [65]:
df1[ (df1['Age'] > 25) | (df1['Department'] == 'IT')]

         Name  Age Department  Salary
emp2      Bob   30         IT   80000
emp3  Charlie   35    Finance   90000
emp4    Diana   28         HR   75000
emp5      Eve   32         IT   85000

In [66]:
departments = ['HR', 'Finance']

In [68]:
df1[df1['Department'].isin(departments)]

         Name  Age Department  Salary
emp1    Alice   25         HR   70000
emp3  Charlie   35    Finance   90000
emp4    Diana   28         HR   75000

In [69]:
df1.query('Age > 30')

         Name  Age Department  Salary
emp3  Charlie   35    Finance   90000
emp5      Eve   32         IT   85000

In [70]:
df1.query('Age > 30 and Department == "IT"')

     Name  Age Department  Salary
emp5  Eve   32         IT   85000

In [71]:
data_with_na = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, np.nan],
    'C': ['x', 'y', None, 'w', 'z']
}
df_na = pd.DataFrame(data_with_na)

In [74]:
df_na.isnull().sum().sum()

4

In [75]:
df_na

     A    B     C
0  1.0  NaN     x
1  2.0  2.0     y
2  NaN  3.0  None
3  4.0  4.0     w
4  5.0  NaN     z

In [76]:
df_na.dropna()

     A    B  C
1  2.0  2.0  y
3  4.0  4.0  w

In [77]:
df_na.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [78]:
df_na.dropna(how='all')

     A    B     C
0  1.0  NaN     x
1  2.0  2.0     y
2  NaN  3.0  None
3  4.0  4.0     w
4  5.0  NaN     z

In [87]:
df_na.dropna(thresh=2)

     A    B  C
0  1.0  NaN  x
1  2.0  2.0  y
3  4.0  4.0  w
4  5.0  NaN  z

In [89]:
df_na1 = df_na.copy()

In [95]:
df_na.dropna(thresh=2, inplace= True)

In [96]:
df_na

     A    B  C
0  1.0  NaN  x
1  2.0  2.0  y
3  4.0  4.0  w
4  5.0  NaN  z

In [97]:
df_na1

     A    B     C
0  1.0  NaN     x
1  2.0  2.0     y
2  NaN  3.0  None
3  4.0  4.0     w
4  5.0  NaN     z

In [98]:
df_na1.fillna(11)

      A     B   C
0   1.0  11.0   x
1   2.0   2.0   y
2  11.0   3.0  11
3   4.0   4.0   w
4   5.0  11.0   z

In [99]:
df_na1.fillna(method='ffill')

C:\Users\amitm\AppData\Local\Temp\ipykernel_3500\403020958.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_na1.fillna(method='ffill')

     A    B  C
0  1.0  NaN  x
1  2.0  2.0  y
2  2.0  3.0  y
3  4.0  4.0  w
4  5.0  4.0  z

In [100]:
df_na1.fillna(method='bfill')

C:\Users\amitm\AppData\Local\Temp\ipykernel_3500\290181876.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_na1.fillna(method='bfill')

     A    B  C
0  1.0  2.0  x
1  2.0  2.0  y
2  4.0  3.0  w
3  4.0  4.0  w
4  5.0  NaN  z

In [105]:
df_na1.fillna(df_na1["A"].mean(), inplace=True)

In [106]:
df_na1

     A    B    C
0  1.0  3.0    x
1  2.0  2.0    y
2  3.0  3.0  3.0
3  4.0  4.0    w
4  5.0  3.0    z

In [110]:
df_types = pd.DataFrame({
    'wholenum': ['1', '2', '3', '4'],
    'decimal': ['1.1', '2.2', '3.3', '4.4'],
    'datetime': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04'],
    'categories': ['A', 'B', 'A', 'C']
})

In [111]:
df_types

  wholenum decimal    datetime categories
0        1     1.1  2023-01-01          A
1        2     2.2  2023-01-02          B
2        3     3.3  2023-01-03          A
3        4     4.4  2023-01-04          C

In [112]:
df_types.dtypes

wholenum      object
decimal       object
datetime      object
categories    object
dtype: object

In [119]:
df_types["wholenum"]= df_types["wholenum"].astype(int)

In [124]:
df_types.dtypes

wholenum        int32
decimal       float64
datetime       object
categories     object
dtype: object

In [123]:
df_types["decimal"]= df_types["decimal"].astype(float)

In [125]:
df_types["datetime"].astype(date)

NameError: name 'date' is not defined

In [127]:
df_types["datetime"]= pd.to_datetime(df_types["datetime"])

In [134]:
df_types.dtypes

wholenum               int32
decimal              float64
datetime      datetime64[ns]
categories          category
dtype: object

In [133]:
df_types["categories"]= df_types["categories"].astype("category")

In [137]:
df_mixed = pd.DataFrame({'colname': ['1', '2', 'three', '4']})

In [138]:
df_mixed

  colname
0       1
1       2
2   three
3       4

In [139]:
df_mixed.dtypes

colname    object
dtype: object

In [140]:
df_mixed["colname"].astype(int)

ValueError: invalid literal for int() with base 10: 'three'

In [142]:
pd.to_numeric(df_mixed["colname"], errors="coerce")

0    1.0
1    2.0
2    NaN
3    4.0
Name: colname, dtype: float64

In [146]:
df_mixed["colname"]= df_mixed["colname"].str.replace("three","3")

In [148]:
df_mixed["colname"].astype(int)

0    1
1    2
2    3
3    4
Name: colname, dtype: int32

In [149]:
df_types

   wholenum  decimal   datetime categories
0         1      1.1 2023-01-01          A
1         2      2.2 2023-01-02          B
2         3      3.3 2023-01-03          A
3         4      4.4 2023-01-04          C

In [150]:
df_types["newcol"] = df_types["wholenum"] * df_types["decimal"]

In [153]:
df_types1 = df_types.copy()

In [154]:
df_types1

   wholenum  decimal   datetime categories  newcol
0         1      1.1 2023-01-01          A     1.1
1         2      2.2 2023-01-02          B     4.4
2         3      3.3 2023-01-03          A     9.9
3         4      4.4 2023-01-04          C    17.6

In [155]:
df_types

   wholenum  decimal   datetime categories  newcol
0         1      1.1 2023-01-01          A     1.1
1         2      2.2 2023-01-02          B     4.4
2         3      3.3 2023-01-03          A     9.9
3         4      4.4 2023-01-04          C    17.6

In [157]:
df2= pd.read_csv("F:\\Dataset\\onlineretails.csv")

In [158]:
df2.shape

(541909, 10)

In [159]:
df2.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
Data_copy       object
descrip         object
dtype: object

In [160]:
df2.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Data_copy,descrip
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01,2.55,17850.0,United Kingdom,12/1/10 8:26,WHITE HANGING HEART T-LIGHT HOLDER
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01,3.39,17850.0,United Kingdom,12/1/10 8:26,WHITE METAL LANTERN
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01,2.75,17850.0,United Kingdom,12/1/10 8:26,CREAM CUPID HEARTS COAT HANGER
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01,3.39,17850.0,United Kingdom,12/1/10 8:26,KNITTED UNION FLAG HOT WATER BOTTLE
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01,3.39,17850.0,United Kingdom,12/1/10 8:26,RED WOOLLY HOTTIE WHITE HEART.